main/plugins/org.talend.designer.components.libs/libs_src/salesforceCRMManagement/org/talend/send.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Header>
		<ns1:SessionHeader soapenv:actor="http://schemas.xmlsoap.org/soap/actor/next"
			soapenv:mustUnderstand="0" xmlns:ns1="urn:partner.soap.sforce.com">
			<ns1:sessionId>
				00D80000000MRki!AQ0AQEV7rfRKmlJ2n5Es4Gcn.Dx7LuBucXNaDDe2txNFafkI_qs53TH09T4Co1NoZwiMcXIGnch9s0ipAWP1MZvSM7Ohfl9r
			</ns1:sessionId>
		</ns1:SessionHeader>
	</soapenv:Header>
	<soapenv:Body>
		<query xmlns="urn:partner.soap.sforce.com">
			<queryString>SELECT Name,
				Account.CreatedBy.CreatedBy.CreatedBy.Email, Account.Owner.city,
				(SELECT Contact.LastName FROM Account.Contacts), (SELECT Note.Title
				FROM Account.Notes), Account.Owner.Country FROM Account
			</queryString>
		</query>
	</soapenv:Body>
</soapenv:Envelope>