components/mediation/mediation-library/connectors/org.wso2.carbon.connector.salesforce/src/main/resources/salesforce/query.xml

<?xml version="1.0" encoding="UTF-8"?>
<template name="query" xmlns="http://ws.apache.org/ns/synapse">
    <parameter name="batchSize"/>
    <parameter name="queryString"/>
    <sequence>
        <property
            expression="get-property('operation','salesforce.serviceUrl')" name="uri.var.salesforce.url"/>
        <payloadFactory>
            <format>
                <soapenv:Envelope
                    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:partner.soap.sforce.com">
                    <soapenv:Header>
                        <urn:QueryOptions>
                            <urn:batchSize>$1</urn:batchSize>
                        </urn:QueryOptions>
                        <urn:SessionHeader>
                            <urn:sessionId>$2</urn:sessionId>
                        </urn:SessionHeader>
                    </soapenv:Header>
                    <soapenv:Body>
                        <urn:query>
                            <urn:queryString>$3</urn:queryString>
                        </urn:query>
                    </soapenv:Body>
                </soapenv:Envelope>
            </format>
            <args>
                <arg expression="$func:batchSize"/>
                <arg expression="get-property('operation','salesforce.sessionId')"/>
                <arg expression="$func:queryString"/>
            </args>
        </payloadFactory>
        
        <property name="messageType" scope="axis2" value="text/xml" />
		<header name="Action" value="urn:partner.soap.sforce.com/Soap/queryRequest" />
        
        
        <!-- <call>
            <endpoint>
                <http method="POST" uri-template="{uri.var.salesforce.url}">
            		<timeout>
               			<duration>60000</duration>
               			<responseAction>fault</responseAction>
            		</timeout>
            		<suspendOnFailure>
               			<initialDuration>2000</initialDuration>
               			<progressionFactor>1.0</progressionFactor>
               			<maximumDuration>3000</maximumDuration>
            		</suspendOnFailure>
         		</http>                
            </endpoint>
        </call>    -->
        <property value="true" name="FORCE_ERROR_ON_SOAP_FAULT" />
        <property name="HTTP_METHOD" scope="axis2" value="POST" />
		<header name="To" expression="$ctx:uri.var.salesforce.url" />
		<call>
			<endpoint>
				<default format="soap11">
					<timeout>
						<duration>60000</duration>
						<responseAction>fault</responseAction>
					</timeout>
					<suspendOnFailure>
						<initialDuration>2000</initialDuration>
						<progressionFactor>1.0</progressionFactor>
						<maximumDuration>3000</maximumDuration>
					</suspendOnFailure>
				</default>
			</endpoint>
		</call>
		
		    
        <property expression="//ns:result/ns:done/text()"
            name="salesforce.query.done" scope="default" type="STRING" xmlns:ns="urn:partner.soap.sforce.com"/>
        <property expression="//ns:result/ns:queryLocator/text()"
            name="salesforce.query.queryLocator" scope="default"
            type="STRING" xmlns:ns="urn:partner.soap.sforce.com"/>
        <property expression="//ns:result/ns:size/text()"
            name="salesforce.query.recordSize" scope="default"
            type="STRING" xmlns:ns="urn:partner.soap.sforce.com"/>
        <class name="org.wso2.carbon.connector.salesforce.QueryMoreIterator"/>
    </sequence>
</template>
