salesforce/1.0.0/src/main/resources/salesforce/query.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--
  Copyright (c) 2015, WSO2 Inc. (http://www.wso2.org) All Rights Reserved.
    WSO2 Inc. licenses this file to you under the Apache License,
    Version 2.0 (the "License"); you may not use this file except
    in compliance with the License.
    You may obtain a copy of the License at
      http://www.apache.org/licenses/LICENSE-2.0

   Unless required by applicable law or agreed to in writing,
   software distributed under the License is distributed on an
   "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
   KIND, either express or implied.  See the License for the
   specific language governing permissions and limitations
   under the License.
  -->

<template name="query" xmlns="http://ws.apache.org/ns/synapse">
    <parameter name="batchSize"/>
    <parameter name="queryString"/>
    <parameter name="queryMore"/>
    <sequence>
        <property
                expression="get-property('operation','salesforce.serviceUrl')" name="uri.var.salesforce.url"/>

        <property
                expression="$func:batchSize" name="uri.var.batchSize"/>

        <property name="uri.var.queryMore" expression="$func:queryMore"/>

        <payloadFactory>
            <format>
                <soapenv:Envelope
                        xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:partner.soap.sforce.com">
                    <soapenv:Header>
                        <urn:QueryOptions>
                            <urn:batchSize>$1</urn:batchSize>
                        </urn:QueryOptions>
                        <urn:SessionHeader>
                            <urn:sessionId>$2</urn:sessionId>
                        </urn:SessionHeader>
                    </soapenv:Header>
                    <soapenv:Body>
                        <urn:query>
                            <urn:queryString>$3</urn:queryString>
                        </urn:query>
                    </soapenv:Body>
                </soapenv:Envelope>
            </format>
            <args>
                <arg expression="$func:uri.var.batchSize"/>
                <arg expression="get-property('operation','salesforce.sessionId')"/>
                <arg expression="$func:queryString"/>
            </args>
        </payloadFactory>

        <property name="messageType" scope="axis2" value="text/xml" />
        <header name="Action" value="urn:partner.soap.sforce.com/Soap/queryRequest" />
        <property value="true" name="FORCE_ERROR_ON_SOAP_FAULT" />
        <property name="HTTP_METHOD" scope="axis2" value="POST" />
        <header name="To" expression="$ctx:uri.var.salesforce.url" />
        <call>
            <endpoint>
                <default format="soap11">
                    <timeout>
                        <duration>60000</duration>
                        <responseAction>fault</responseAction>
                    </timeout>
                    <suspendOnFailure>
                        <initialDuration>2000</initialDuration>
                        <progressionFactor>1.0</progressionFactor>
                        <maximumDuration>3000</maximumDuration>
                    </suspendOnFailure>
                </default>
            </endpoint>
        </call>


        <property expression="//ns:result/ns:done/text()"
                  name="salesforce.query.done" scope="default" type="STRING" xmlns:ns="urn:partner.soap.sforce.com"/>
        <property expression="//ns:result/ns:queryLocator/text()"
                  name="salesforce.query.queryLocator" scope="default"
                  type="STRING" xmlns:ns="urn:partner.soap.sforce.com"/>

        <property xmlns:sfp="urn:partner.soap.sforce.com" xmlns:sfo="urn:sobject.partner.soap.sforce.com"
                  xmlns:ns="http://org.apache.synapse/xsd" name="resultsCount" expression="//sfp:records"/>
        <log level="custom">
            <property name="8987788987879887879887879878798787987978" expression="get-property('resultsCount')"/>
        </log>
        <property name="RESULTS" expression="fn:concat(get-property('RESULTS'),get-property('resultsCount'))"/>
        <filter xpath="(not(get-property('salesforce.query.queryLocator') = '' or (not(string(get-property('salesforce.query.queryLocator')))))) and get-property('uri.var.queryMore')='true'">
            <then>
                <salesforce.queryMore/>
            </then>
            <else>
                <payloadFactory>
                    <format>
                        <soapenv:Envelope
                                xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
                            <soapenv:Body>
                                <results>$1</results>
                            </soapenv:Body>
                        </soapenv:Envelope>
                    </format>
                    <args>
                        <arg expression="get-property('RESULTS')"/>
                    </args>
                </payloadFactory>
            </else>
        </filter>

    </sequence>
</template>